# Pivot Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HomeCamera..::..Pivot Property
HomeCamera Class See Also
---
The pivot point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ Pivot { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Pivot As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Pivot {
	XYZ^ get ();
}
```

# See Also
HomeCamera Class
Autodesk.Revit.DB Namespace